alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
}

// --- RGB LED ---
void setRGBLed(uint8_t r, uint8_t g, uint8_t b) {
    // Active LOW: invert each channel
    ledcWrite(LED_R_CH, 255 - r);
    ledcWrite(LED_G_CH, 255 - g);
    ledcWrite(LED_B_CH, 255 - b);
}

void setupRGBLed() {
    ledcSetup(LED_R_CH, LED_PWM_FREQ, LED_PWM_BITS);
    ledcSetup(LED_G_CH, LED_PWM_FREQ, LED_PWM_BITS);
    ledcSetup(LED_B_CH, LED_PWM_FREQ, LED_PWM_BITS);
    ledcAttachPin(LED_R_PIN, LED_R_CH);
    ledcAttachPin(LED_G_PIN, LED_G_CH);
    ledcAttachPin(LED_B_PIN, LED_B_CH);
    setRGBLed(0, 0, 0);  // off at start
}

// Set LED colour based on WiFi RSSI (called after every health check)
// Blue ≥-55  Cyan ≥-65  Green ≥-75  Orange=weak-but-connected  Red=lost
void updateLedWifi() {
    if (WiFi.status() != WL_CONNECTED) {
        setRGBLed(255, 0, 0);   // Red: WiFi lost
        return;
    }
    int rssi = WiFi.RSSI();
    if      (rssi >= RSSI_THRESH_BLUE)  setRGBLed(  0,   0, 255);  // Blue:   strongest
    else if (rssi >= RSSI_THRESH_CYAN)  setRGBLed(  0, 255, 255);  // Cyan:   good
    else if (rssi >= RSSI_THRESH_GREEN) setRGBLed(  0, 255,   0);  // Green:  fair
    else                  setRGBLed(255, 128,   0);  // Orange: weak
}

// --- WiFi ---
// Returns true if connected. Pass showSplash=true for boot (draws title + "Connecting:" text).
bool connectWiFi(const char* ssid, const char* pass, bool showSplash = false) {
    if (showSplash) {
        tft.setFreeFont(&DejaVuSansBold12px);
        tft.setTextColor(TFT_YELLOW, COL_BG);
        tft.drawString("CYD AI chatbot v: 0.1.", 0, 0);
        tft.drawString("It's cheap for a reason.", 0, LINE_H_LARGE);
        tft.setTextColor(TFT_BLUE, COL_BG);
        char wifiMsg[80];
        snprintf(wifiMsg, sizeof(wifiMsg), "Connecting: %.55s...", ssid);
        tft.drawString(wifiMsg, 0, 2 * LINE_H_LARGE);
        tft.setTextFont(1);
    }
    WiFi.mode(WIFI_STA);
    WiFi.begin(ssid, pass);
    int attempts = 0;
    while (WiFi.status() != WL_CONNECTED && attempts < WIFI_MAX_ATTEMPTS) {
        delay(WIFI_RETRY_DELAY_MS);
        attempts++;
    }
    if (showSplash) tft.fillRect(0, 0, SCREEN_W, SPLASH_H, COL_BG);
    updateLedWifi();
    return WiFi.status() == WL_CONNECTED;
}

// Scan WiFi, let user pick an AP, handle password entry, connect.
// Loops until connected. Call from setup() when connectWiFi() returns false.
void selectAP() {
    while (true) {  // outer: re-scan loop
        // --- Scan ---
        tft.fillScreen(COL_BG);
        tft.setTextFont(1); tft.setTextColor(TFT_YELLOW, COL_BG);
        tft.setCursor(0, 0); tft.print("Scanning WiFi...");

        int n = WiFi.scanNetworks();

        if (n <= 0) {
            tft.fillScreen(COL_BG);
            tft.setCursor(0, 0); tft.print("No networks found. Tap to retry.");
            while (!ts.touched()) delay(50);
            while (ts.touched()) delay(5);
            continue;
        }

        // Sort indices by RSSI descending, keep top 9
        int indices[40];
        int total = (n < 40) ? n : 40;
        for (int i = 0; i < total; i++) indices[i] = i;
        for (int i = 0; i < total - 1; i++) {
            for (int j = i + 1; j < total; j++) {
                if (WiFi.RSSI(indices[j]) > WiFi.RSSI(indices[i])) {
                    int tmp = indices[i]; indices[i] = indices[j]; indices[j] = tmp;
                }
            }
        }
        int apCount = (total < 9) ? total : 9;

        char apSsids[9][33];
        int  apRssi[9];
        for (int i = 0; i < apCount; i++) {
            strncpy(apSsids[i], WiFi.SSID(indices[i]).c_str(), 32);
            apSsids[i][32] = '\0';
            apRssi[i] = WiFi.RSSI(indices[i]);
        }
        WiFi.scanDelete();

        drawAPList(apSsids, apRssi, apCount);

        // --- Wait for AP selection ---
        int selected = -1;
        while (selected < 0) {
            if (!ts.touched()) continue;
            TS_Point pt = ts.getPoint();
            while (ts.touched()) delay(5);
            int sx, sy;
            mapTouch(pt, sx, sy);
            for (int i = 0; i < apCount; i++) {
                int rowY = AP_ROW_H * (i + 1);
                if (sy >= rowY && sy < rowY + AP_ROW_H) { selected = i; break; }
            }
        }

        char selSsid[33];
        strncpy(selSsid, apSsids[selected], 32); selSsid[32] = '\0';

        // --- Password + connect loop for this AP ---
        while (true) {
            char pass[64] = {0};
            bool hasStored = findWifiPass(selSsid, pass);

            if (!hasStored) {
                enterPassword(selSsid, pass);
            }

            // Show connecting
            tft.fillScreen(COL_BG);
            tft.setTextFont(1); tft.setTextColor(TFT_BLUE, COL_BG);
            char msg[80]; snprintf(msg, sizeof(msg), "Connecting: %.55s...", selSsid);
            tft.setCursor(0, 0); tft.print(msg);

            bool ok = connectWiFi(selSsid, pass);

            if (ok) {
                insertWifiCred(selSsid, pass);
                return;  // connected — setup() continues to selectModel()
            }

            // --- Failed: offer re-enter or new scan ---
            tft.fillScreen(COL_BG);
            tft.setTextFont(1);
            tft.setTextColor(TFT_RED, COL_BG);
            char failMsg[64]; snprintf(failMsg, sizeof(failMsg), "Failed: %.40s", selSsid);
            tft.setCursor(2, (AP_ROW_H - 8) / 2); tft.print(failMsg);

            // Draw two option rows (same style as AP list)
            static const char* opts[] = { "1  Re-enter password", "2  New scan" };
            for (int i = 0; i < 2; i++) {
                int y = AP_ROW_H * (i + 1);
                tft.fillRect(0, y, SCREEN_W, AP_ROW_H - 1, COL_KEY_FACE);
                tft.setTextColor(COL_KEY_LABEL, COL_KEY_FACE);
                tft.setCursor(2, y + (AP_ROW_H - 8) / 2);
                tft.print(opts[i]);
            }

            // Wait for tap on row 1 or 2
            int choice = 0;
            while (choice == 0) {
                if (!ts.touched()) continue;
                TS_Point pt = ts.getPoint();
                while (ts.touched()) delay(5);
                int sx, sy; mapTouch(pt, sx, sy);
                if (sy >= AP_ROW_H && sy < AP_ROW_H * 2) choice = 1;  // re-enter
                if (sy >= AP_ROW_H * 2 && sy < AP_ROW_H * 3) choice = 2;  // new scan
            }

            if (choice == 2) break;  // break inner loop → outer re-scan loop
            // choice == 1: clear stored pass, loop inner (enterPassword runs next iteration)
            clearWifiPass(selSsid);
        }
    }
}

